import Vue from 'vue';
export default {
    namespaced: true,
    state: {
        chartsData:{
            medicineCheck:{ //医学排查人数
                columns: ['xAxis', '排查人数'],
                rows: [
                    { 'xAxis': '报警', '排查人数': 500},
                    { 'xAxis': '可疑', '排查人数': 456},
                    { 'xAxis': '采样', '排查人数': 300},
                    { 'xAxis': '确诊', '排查人数': 368}
                ]
            },
            checkOut:{ //检出率
                columns: ['xAxis', '出境人数','流调人数','检出率'],
                rows: [
                    { 'xAxis': '一月', '出境人数': 500,'流调人数':300,'检出率':0.12},
                    { 'xAxis': '二月', '出境人数': 456,'流调人数':400,'检出率':0.345},
                    { 'xAxis': '三月', '出境人数': 300,'流调人数':360,'检出率':0.7},
                    { 'xAxis': '四月', '出境人数': 368,'流调人数':200,'检出率':0.31}
                ]
            },
            diagnose:{  //确诊率
                columns: ['xAxis', '发热人数','确诊人数','确诊率'],
                rows: [
                    { 'xAxis': '一月', '发热人数': 500,'确诊人数':300,'确诊率':0.12},
                    { 'xAxis': '二月', '发热人数': 456,'确诊人数':400,'确诊率':0.345},
                    { 'xAxis': '三月', '发热人数': 300,'确诊人数':360,'确诊率':0.7},
                    { 'xAxis': '四月', '发热人数': 368,'确诊人数':200,'确诊率':0.31}
                ]
            },
            mapData:{
                columns: ['位置', ' 人员来源地'],
                rows: [
                    { '位置': 'China', '人员来源地': 123 }
                ]
            },
            diagnoseCases:{  //确诊病例
                columns: ['xAxis', '病例'],
                rows: [
                    { 'xAxis': '麻疹', '病例': 500},
                    { 'xAxis': '禽流感', '病例': 456},
                    { 'xAxis': '甲乙型流感', '病例': 300},
                    { 'xAxis': '中东呼吸综合征', '病例': 368}
                ]
            }
        }
    },
    mutations:{

    }
}